Repository: TAKeanice/pgs
Catalog: PlaygroundBook/PrivateResources/*.lproj/Localizable.strings
Languages: de

# result.upload.failed
source: Program upload failed.
de: Programm konnte nicht übertragen werden.

# result.upload.missing
source: Program upload failed. Calliope mini is missing.
de: Das Programm konnte nicht übertragen werden. Calliope mini nicht gefunden.

# result.upload.success
source: Program uploaded.
de: Das Programm wurde erfolgreich übertragen.

# alert.notconnected.title
source: Your Calliope mini is not connected.
de: Dein Calliope mini ist nicht verbunden.

# ble.name.unknown
source: Unknown
de: Unbekannt

# page.hint1
source: Hint 1
de: Tip 1

# page.hint2
source: Hint 2
de: Tip 2

# page.hint3
source: Hint 3
de: Tip 3

# page.solution
source: The Solution.
de: Die Lösung.

# page.success
source: ### Well done! The way you’re solving problems here is exactly what coders do. (@next).
de: ### Super gemacht! So lösen das ProgrammiererInnen. (@next).

# page.hint.time
source: The delay is too short
de: Die Pause ist zu klein

# page.solution.time
source: The value should exceed 100.
de: Der Wert sollte über 100 sein.

# connect.startSearch
source: Search
de: Suchen

# connect.waitForBluetooth
source: Bluetooth must be on!
de: Bluetooth muss an sein!

# connect.searching
source: Searching...
de: Suche...

# connect.connecting
source: Connecting...
de: Verbinde...

# connect.notFoundRetry
source: Not found. Search again
de: Nicht gefunden. Nochmal suchen

# connect.connect
source: Connect
de: Verbinden

# connect.connected
source: Connected!
de: Verbunden!

# connect.testMode
source: Examining Calliope...
de: Prüfe Calliope...

# connect.readyToPlay
source: Ready to play!
de: Bereit zu spielen!

# connect.wrongProgram
source: Calliope must be in mode 5!
de: Calliope muss in Modus 5 sein!

# bookProgramOutputString.solution
source: You could write "Have a good day!"
de: Der Text könnte zum Beispiel „Guten Tag!” lauten.

# bookProgramOutputGrid.solution
source: Try with [0,0,0,0,0, 0,1,0,1,0, 0,0,0,0,0, 1,0,0,0,1, 0,1,1,1,0]
de: Versuchs mit [0,0,0,0,0, 0,1,0,1,0, 0,0,0,0,0, 1,0,0,0,1, 0,1,1,1,0]

# bookProgramOutputCombination.solution
source: Try this text: "Have a good day!"
de: Versuchs mit diesem Text: „Guten Tag!”

# bookProgramInputShake.solution
source: Try this text: "Have a good day!"
de: Versuchs mit diesem Text: „Guten Tag!”

# bookProgramInputCombination.solution
source: Use this as template input and replace numbers with 1s and 0s: [0,0,0,0,0, 0,1,0,1,0, 0,0,0,0,0, 1,0,0,0,1, 0,1,1,1,0]
de: Nimm diese Eingabe als Vorlage und ersetze die Zahlen durch Einsen oder Nullen: [0,0,0,0,0, 0,1,0,1,0, 0,0,0,0,0, 1,0,0,0,1, 0,1,1,1,0]

# bookProgramCommandStart.solution
source: Try this text: "Have a good day!"
de: Versuchs mit diesem Text: „Guten Tag!”

# bookProgramCommandSleep.solution
source: Use a number between 100 (0.1s) and 30000 (30s) as sleep duration.
de: Gebe eine Zahl zwischen 100 (0,1s) und 30000 (30s) als Dauer an.

# bookProgramCommandClear.solution
source: Use a number between 100 (0.1s) and 30000 (30s) as sleep duration.
de: Gebe eine Zahl zwischen 100 (0,1s) und 30000 (30s) als Dauer an.

# bookProgramCommandForever.solution
source: Use a number between 100 (0.1s) and 30000 (30s) as sleep duration.
de: Gebe eine Zahl zwischen 100 (0,1s) und 30000 (30s) als Dauer an.

# bookProgramCommandVariables.solution
source: Use a number between 100 (0.1s) and 30000 (30s) as sleep duration. As age, you should use something between 0 and 200 (If you know someone older, please tell us!)
de: Gebe eine Zahl zwischen 100 (0,1s) und 30000 (30s) als Dauer an. Als Alter solltest du etwas zwischen 0 und 200 verwenden (falls du jemand älteren kennst, gib uns Bescheid!)

# bookProgramCommandLoops.solution
source: Use a number between 100 (0.1s) and 30000 (30s) as sleep duration. The start and stop of the loop must be between 0 and 32000, and the start must be lower than the stop.
de: Gebe eine Zahl zwischen 100 (0,1s) und 30000 (30s) als Dauer an. Der Anfang und das Ende der Schleife muss zwischen 0 und 32000 liegen, außerdem muss der Anfang niedriger sein als das Ende.

# bookProgramCommandRandom.solution
source: The lower and upper boundary of the random number must be between 0 and 32000, and the lower boundary must be lower than the upper boundary.
de: Die untere und die obere Grenze für die Zufallszahl muss zwischen 0 und 32000 liegen, außerdem muss der die untere Grenze niedriger sein als die obere.

# bookProgramCommandConditionals.solution
source: The lower and upper boundary of the random number must be between 0 and 32000, and the lower boundary must be lower than the upper boundary. As text, you can use something like "true" or "false"
de: Die untere und die obere Grenze für die Zufallszahl muss zwischen 0 und 32000 liegen, außerdem muss der die untere Grenze niedriger sein als die obere. Als Text kannst du etwas verwenden wie „wahr” oder „falsch”

# bookProgramProjectDice.solution
source: The lower boundary for the numbers of the dice should be 1, the upper boundary something higher (e.g. 6) Use a number between 100 (0.1s) and 30000 (30s) as sleep duration.
de: Geb als untere Grenze für die gewürfelte Zahl 1 und für die obere etwas höheres (z.B. 6) ein. Gebe eine Zahl zwischen 100 (0,1s) und 30000 (30s) als Dauer an.

# bookProgramProjectRockPaperScissors.solution
source: Use a number between 100 (0.1s) and 30000 (30s) as sleep duration.
de: Gebe eine Zahl zwischen 100 (0,1s) und 30000 (30s) als Dauer an.

# bookProgramProjectClap.solution
source: The boundary of the clap must not be 0, as this would be total silence!
de: Der Schwellwert für Klatschen darf nicht 0 sein, denn das wäre totale Stille!

# bookProgramProjectThermometer.solution
source: The temperature must not be under 0°C (32°F) or above 100°C (212°F), this would damage your Calliope anyway! Choose 20°C/68°F as „cold” temperature for example. Additionally, the „normal” temperature must be higher than the „cold” temperature. Choose 25°C/77°F for example.
de: Die Temperatur darf nicht unter 0°C (32°F) oder über 100°C (212°F) liegen, das würde deinen Calliope sowieso beschädigen! Geb zum Beispiel 20°C/68°F „kalte” Temperatur ein. Außerdem muss die „normale” Temperatur höher sein als die „kalte”. Wähle zum Beispiel 25°C/77°F.
